// Introduction to JavaScript

/* 
#1 console.log

როგორც პითონში პითონში ასევე JavaScript-ში ჩვენ შეგვიძლია მონაცემის ტერმინალში/კონსოლში გამოტანა და ეს ხდება console.log-ის მეშვეობით

ესე რომ ვთქვათ console.log() == print()
სხვაობა არის მხოლოდ იმაში რომ console.log()-ით დაბრუნებული მონაცემი გამოისახება console განყოფილებაში 

// ------------------------------------------------------------------------------------------------------------------------------------

#2 კომენტარები

JavaScript-ში არსებობს ორი ტიპის კომენტარი
1) // - ერთ ხაზიანი კომენტარი იგივე ctrl & / (?)
2) /*  მრავალხაზიანი კომენტარი

// ------------------------------------------------------------------------------------------------------------------------------------

#3 მონაცემთა ტიპები

javascript-ში არსებობს სულ 8+ მონაცემთა ტიპი ესენია
1)Number - მონაცემთა ტიპი რომელშიც შედის ნებისმიერი რიცხვი მთელიც და ათწილადის (მოკლედ integer-ის და float-ის გაერთიანებაა)

2)BigInt - მონაცემთა ტიპი რომელშიც შედის ძალიან დიდი მთელი რიცხვები მაგ 2^88 (^-ხარისხში აყვანა)

3)string - მონაცემთა ტიპი რომელშც შედის ნებისმიერი სიმბოლო რომელიცაა მოქცეული ბრჭყალებს შორის (' ' ან " ")

4)boolean - მონაცემთა ტიპი რომელსაც აქვს მხოლოდ ორი მნიშვნელბა ეს არის true და false

5)Null - მონაცემთა ტიპი რომელსაც არ აქვს მნიშვნელობა გარდა ' '(space-ის ანუ გამოტოვების)

6)Undefined - მონაცემთა ტიპი რომელსაც საერთოდ არ აქვს მნიშვნელობა

7)Symbol - მონაცემთა ტიპი რომელიც ქმნის უნიკალურ მნიშვნელობას

8)Object - მონაცემთა ტიპი, რომელიც ერთმანეთთან დაკავშირებულ მონაცემებს ინახავს

// ------------------------------------------------------------------------------------------------------------------------------------

#4 არითმეტიკული ოპერატორები

Add: +
Subtract: -
Multiply: *
Divide: /
Remainder: %

1) + მიმატება

2) - გამოკლება

3) * გამრავლება

4) / გაყოფა 

5) % ნაშთიანი

6) **	ხარისხში აყვანა

7) ++	1-ით გაზრდა	

8) --	1-ით შემცირება

// ------------------------------------------------------------------------------------------------------------------------------------

#5 სტრინგების კონკატინაცია 

კონკატინაცია არის სტრინგთან რაიმე მონაცემის დაკავშირება უმეტეს შემთხვევაშია 2 სტრინგის დაკავშირება ერთმანეთთან

მაგრამ შეგვიძლია ასევე ესეთი რამის გაკეთება 'nika ' + 15 და არანაირი ერორი არ იქნება



// ------------------------------------------------------------------------------------------------------------------------------------

#6 თვისებები + მეთოდები
1).length — სიგრძე (სიმბოლოების ან ელემენტების რაოდენობა)

2).toUpperCase() — დიდ ასოებად გადაყვანა

3).toLowerCase() — პატარა ასოებად გადაყვანა

4).trim() — ზედმეტი გამოტოვებების წაშლა

5).includes() — ამოწმებს შეიცავს თუ არა

6) .startsWith() — ამოწმებს რით იწყება

7).endsWith() — ამოწმებს რით მთავრდება

8) .indexOf() — აბრუნებს პოზიციას

9).slice() — ნაწილის ამოჭრა

10).replace() — ჩანაცვლება

11).push() — მასივში ელემენტის დამატება

12).pop() — ბოლო ელემენტის წაშლა

13).shift() — პირველი ელემენტის წაშლა

14).unshift() — დასაწყისში ელემენტის დამატება

15).join() — მასივის ერთ სტრიქონად გაერთიანება

16).split() — სტრიქონის ნაწილებად დაყოფა

17).reverse() — შებრუნება

18).sort() — დალაგება



// ------------------------------------------------------------------------------------------------------------------------------------

#7 ჩაშენებული ობიექტები

Math - მათემატიკური ოპერაციების ჩაშენებული ობიექტი

1)Math.random() - აბრუნებს შემთხვევით რიცხვს ქარნულად გაწერილიაქვს 0 <= x < 1 მაგრამ შეგვიძლია
შევცვალოთ ეს ლიმიტი მაგალითად რომ გავაკეთოთ 0 <= x < 10 უნდა გავამრავლოთ Math.random()-ი 10-ზე 
ანუ Math.random() * 10

2)Math.round() - ამრგვალებს რიცხვებს მათემატიკური წესით თუ მაგ. x >= 10.5-ზე | მაგ 10.6 გვაქვს დაგვიბრუნებს 11
ხოლო თუ გვექნება x< 10.5 | მაგ 10.4 დაგვიბრუნებს 10

3)Math.ceil() - ამრგვალებს ნებისმიერ ათ წილად რიცხვს ზევით მაგალითად რომ გვქონდეს 10.0001 დაგვიბრუნებს 11-ს

4)Math.floor() - ამრგვალებს ნებისმიერ ათ წილად რიცხვს ქვევით მაგალითად რომ გვქონდეს 10.9999 დაგვიბრუნებს 10-ს

5)Math.max() - აბრუნებს ყველაზე დიდ რიცხვს რომელიც მას გადაეცემა მაგალითად Math.max(1, 5, 3) დაგვიბრუნებს 5-ს

6)Math.min() - აბრუნებს ყველაზე მცირე რიცხვს რომელიც მას გადაეცემა მაგალითად Math.min(1, 5, 3) დაგვიბრუნებს 1-ს

7)Math.sign() - აბრუნებს რიცხვის ნიშნს (1, -1 ან 0) 1-ს აბრუნებს თუ რიცხვი დადებითია, -1-ს აბრუნებს თუ რიცხვი უარყოფითია 
და 0-ს აბრუნებს თუ რიცხვი ნულია

8)Math.sqrt() - აბრუნებს რიცხვის ფესვს მაგ რომ გვქონდე რიცხვი 25 დაგვიბრუნებს 5-ს

9)Math.pow() - აბრუნებს რიცხვის ხარისხში აყვანას მაგ რომ გვქონდეს Math.pow(2, 3) დაგვიბრუნებს 8-ს

10)Number.isInteger() - ამოწმებს არის თუ არა რაიმე რიცხვი მთელი რიცხვი მაგ რომ გვქონდეს Number.isInteger(5) დაგვიბრუნებს true-ს 
ხოლო Number.isInteger(5.5) დაგვიბრუნებს false-ს




------------------------------------------------------------------------------------------------------------------------------------

Variables 

მთლიანობაში არსებობს 3 ტიპის ცვლადები javascript-ში ესენია var, let და const

var - არის ძველი ცვლადის შექმნის მეთოდი რომელიც უკვე დიდად არ გამიყენება

let, const - var-თან შედარებით არის ახალი ცვლადის შექმნის მეთოდი 

let არის ცვლადის შექმნის ტიპი რომლელსაც ჩვენ შექმნის შემდეგ შეგვიძლია მისი მნიშვნელობის შეცვლა

const არის ცვლადის შექმნის ტიპი რომლსაც ჩვენ შექმნის შემდეგ ვერანაირად ვერ შევცვლით  მისი მნიშვნელობის შეცვლა

------------------------------------------------------------------------------------------------------------------------------------

Mathematical Assignment Operators / მათემატიკური მინიჭების ოპერატორები

javascript-ში არსებობს 6 მათემატიკური მინიჭების ოპერატორი ესენია
1) +=  - მიმატება (არ არის საჭირო რომ გავწეროთ მაგ x = 5; x = x + 3; ამის მაგივრად შეგვიძლია x += 3;)

2) -=  - გამოკლება (არ არის საჭირო რომ გავწეროთ მაგ x = 5; x = x - 3; ამის მაგივრად შეგვიძლია x -= 3;)

3) *=  - გამრავლება (არ არის საჭირო რომ გავწეროთ მაგ x = 5; x = x * 3; ამის მაგივრად შეგვიძლია x *= 3;)

4) /=  - გაყოფა (არ არის საჭირო რომ გავწეროთ მაგ x = 5; x = x / 3; ამის მაგივრად შეგვიძლია x /= 3;)

5) %=  - ნაშთიანი გაყოფა (არ არის საჭირო რომ გავწეროთ მაგ x = 5; x = x % 3; ამის მაგივრად შეგვიძლია x %= 3;)

6) **=  - ხარისხში აყვანა (არ არის საჭირო რომ გავწეროთ მაგ x = 5; x = x ** 3; ამის მაგივრად შეგვიძლია x **= 3;)

--------------------------------------------------------------------------------------------------------------------------------------

The Increment and Decrement Operator / ზრდისა და შემცირების ოპერატორი

javascript-ში არსებობს 2 ზრდისა და შემცირების ოპერატორი ესენია
1) ++  - 1-ით გაზრდა (არ არის საჭირო რომ გავწეროთ მაგ x = 5; x = x + 1; ამის მაგივრად შეგვიძლია x++ და ყოველ ჯერზე 1-ით გაიზრდება;)

2) --  - 1-ით შემცირება (არ არის საჭირო რომ გავწეროთ მაგ x = 5; x = x - 1; ამის მაგივრად შეგვიძლია x-- და ყოველ ჯერზე 1-ით შეიმცირება;)

-------------------------------------------------------------------------------------------------------------------------------------

String Interpolation / სტრინგის ინტერპოლაცია

სტრინგის ინტერპოლაცია თითქმის იგივეა რაც f-სტრინგი python-ში

განსხვავდება მხოლოდ სინტაქსით 

javascript-ში სტრინგის ინტერპოლაციისთვის ვიყენებთ ბრჭყალებს ` ` და ვწერთ ${} და ამ კლაკლინ ბრჭყალებს შორის ვწერთ ცვლადის სახელს

-------------------------------------------------------------------------------------------------------------------------------------

typeof operator

typeof იგივეა რაც type() python-ში

და იგი აბრუნებს მონაცემის ტიპს მაგალითად typeof 5 დაგვიბრუნებს number-ს

-------------------------------------------------------------------------------------------------------------------------------------

conditional statements / პირობითი ოპერატორები

javascript-ში არსებობს 3 პირობითი ოპერატორი ესენია

1) if - მთავარი პირობა მისი სინტაქსი არის
if (პირობა) {
    კოდი 
}

2) else if - მეორე ხარისხოვანი პირობა მისი სინტაქსი არის
else if (პირობა) {
    კოდი
}

3) else - საბოლოო პირობა მისი სინტაქსი არის
else {
    კოდი
}

-------------------------------------------------------------------------------------------------------------------------------------

Comparison Operators / შედარების ოპერატორები

javascript-ში არსებობს 8 შედარების ოპერატორი ესენია
1) === - მკაცრი ტოლობა

2) !== - არ უდრის

3) > - მეტია

4) < - ნაკლებია

5) >= - მეტია ან ტოლია

6) <= - ნაკლებია ან ტოლია

-------------------------------------------------------------------------------------------------------------------------------------

logical operators / ლოგიკური ოპერატორები

javascript-ში არსებობს 3 ლოგიკური ოპერატორი ესენია

1) && - და (and)

2) || - ან (or)

3) ! - არა (not)

-------------------------------------------------------------------------------------------------------------------------------------

Truthy and Falsy
javascript-ში არსებობს 2 ტიპის მნიშვნელობა ესენია
1) Truthy - ყველაფერი რაც არ არის falsy არის truthy

2) Falsy - არ არის true და ესენია

2.1) false
2.2) 0
2.3) -0
2.4) 0n
2.5) ""
2.6) null
2.7) undefined
2.8) NaN


-------------------------------------------------------------------------------------------------------------------------------------

Truthy and Falsy Assignment / ჭეშმარიტი და მცდარი მინიჭება

javascript-ში არსებობს 2 ტიპის ჭეშმარიტი და მცდარი მინიჭება ესენია
1) || - ან (or) მინიჭება
2) && - და (and) მინიჭება

-------------------------------------------------------------------------------------------------------------------------------------
prompt იგივე input() python-ში

prompt ის საშუალებით ჩვენ ვიღებთ მომხმარებლისგან ინფორმაციას და შეგვიძლია გავაკეთოთ პერსონალური მისალმება მომხმარებლისთვის ან რამე სხვა

-------------------------------------------------------------------------------------------------------------------------------------






-------------------------------------------------------------------------------------------------------------------------------------






-------------------------------------------------------------------------------------------------------------------------------------






-------------------------------------------------------------------------------------------------------------------------------------






-------------------------------------------------------------------------------------------------------------------------------------






-------------------------------------------------------------------------------------------------------------------------------------






-------------------------------------------------------------------------------------------------------------------------------------






-------------------------------------------------------------------------------------------------------------------------------------






-------------------------------------------------------------------------------------------------------------------------------------






-------------------------------------------------------------------------------------------------------------------------------------






-------------------------------------------------------------------------------------------------------------------------------------






-------------------------------------------------------------------------------------------------------------------------------------






-------------------------------------------------------------------------------------------------------------------------------------






-------------------------------------------------------------------------------------------------------------------------------------






-------------------------------------------------------------------------------------------------------------------------------------






-------------------------------------------------------------------------------------------------------------------------------------






-------------------------------------------------------------------------------------------------------------------------------------






-------------------------------------------------------------------------------------------------------------------------------------






-------------------------------------------------------------------------------------------------------------------------------------






-------------------------------------------------------------------------------------------------------------------------------------






-------------------------------------------------------------------------------------------------------------------------------------






-------------------------------------------------------------------------------------------------------------------------------------






-------------------------------------------------------------------------------------------------------------------------------------











































































































































































































































































































































































































































































































































































*/